{
  "characters": [
    {
      "id": "character1",
      "name": "Reimu Hakurei",
      "description": "Wonderful Shrine Maiden of Paradise",
      "health": 100,
      "movement_speed": "Medium",
      "focused_speed": "Slow",
      "initial_bombs": 3,
      "bomb_cherry_loss": "small",
      "special_ability": [ "Smaller Hitbox.", "Extra time for bombing after getting hit." ],
      "shot_types": [
        {
          "name": "Shot Type A: Spirit Sign -Pursuit Type-",
          "unfocused_shot": "Homing Amulet: Reimu throws cards in front of her, while the yin-yang options fire weak homing bullets, covering a fair amount of the screen.",
          "focused_shot": "Hakurei Amulet: Reimu throws giant cards (one at a time at low power, four at a time at full power) that home in on enemies, and normal cards straight ahead that don't home in. Get in line with your enemy to increase the damage!",
          "unfocused_bomb": "Fantasy Seal -Spread-: Reimu throws out red orbs in a circular pattern, which grow in size, head back to her, and explode, clearing bullets and damaging enemies.",
          "focused_bomb": "Fantasy Seal -Concentrate-: Giant blasts of energy home in on enemies, causing huge damage and clearing any bullets."
        },
        {
          "name": "Shot Type B: Dream Sign -Rapid-Fire Type-",
          "unfocused_shot": "Persuasion Needle: Reimu fires a spread of cards and thin bullets that don't cover much of the screen, but do considerable damage.",
          "focused_shot": "Extermination: Reimu fires a thin laser with limited horizontal range that does great damage to the enemy.",
          "unfocused_bomb": "Evil Sealing Circle: A wall of energy moves outwards from Reimu, clearing any bullets and inflicting massive damage.",
          "focused_bomb": "Duplex Barrier: Reimu throws a giant square out- this only does damage if an enemy wanders into it, but this bomb mostly clears out bullets for you."
        }
      ],
      "weapons": [
        {
          "id": "weapon1",
          "name": "Spirit Sign -Pursuit Type-",
          "type": "bullet",
          "damage": 10,
          "fire_rate": 0.5,
          "speed": 4,
          "range": 500
        },
        {
          "id": "weapon2",
          "name": "Reimu's Needle Attack",
          "type": "melee",
          "damage": 25,
          "range": 50
        }
      ],
      "abilities": [
        {
          "id": "ability1",
          "name": "Fantasy Seal",
          "cooldown": 10,
          "effect": "Damage over time",
          "duration": 5,
          "area_of_effect": 100
        }
      ],
      "sprite": "reimu_sprite.png",
      "audio": {
        "attack_sound": "reimu_attack.wav",
        "ability_sound": "fantasy_seal.wav"
      }
    },
    {
      "id": "character2",
      "name": "Marisa Kirisame",
      "description": "Ordinary Black Magician",
      "movement_speed": "Fast",
      "focused_speed": "Medium",
      "initial_bombs": 2,
      "bomb_cherry_loss": "Large",
      "special_ability": [ "Low threshold of items' max value.", "Low point of collection boundary." ],
      "shot_types": [
        {
          "name": "Shot Type A: Magic Sign -Power-Oriented Type-",
          "unfocused_shot": "Magic Missile: Marisa fires a spread of magic needles that do good damage, and her 'options' fire green missiles at a tremendous rate.",
          "focused_shot": "Magic Napalm: Much the same as Magic Missile, but the green projectiles are replaced with giant blue spikes that cause massive damage.",
          "unfocused_bomb": "Stardust Reverie: Marisa shoots out a circle of giant stars, damaging any enemies they hit and cancelling out bullets.",
          "focused_bomb": "Milky Way: Marisa launches out a stream of giant stars that don't home in on enemies, but cover most of the screen and inflict heavy damage on bosses."
        },
        {
          "name": "Shot Type B: Love Sign -Penetration Type-",
          "unfocused_shot": "Stream Laser: Marisa fires a spread of magic needles with decent screen-coverage, and her 'options' fire an intermittent laser- the higher her power, the longer the lasers last.",
          "focused_shot": "Illusion Laser: As well as magic needles (which cover less ground than the unfocused shot) Marisa fires a thin but very powerful beam straight ahead.",
          "unfocused_bomb": "Non-Directional Laser: Three lasers spin around Marisa, destroying any enemies and bullets that get caught by them.",
          "focused_bomb": "Master Spark: Master Spark is the most over-the-top attack in the game; the enemy is engulfed in a gigantic, screen-shaking laser attack. Marisa calls it her 'annihilation of love'."
        }
      ],
      "weapons": [
        {
          "id": "weapon1",
          "name": "Marisa's Master Spark",
          "type": "laser",
          "damage": 30,
          "fire_rate": 1.0,
          "speed": 6,
          "range": 800
        }
      ],
      "abilities": [
        {
          "id": "ability1",
          "name": "Magic Missile",
          "cooldown": 8,
          "effect": "Single-target burst damage",
          "duration": 0,
          "area_of_effect": 0
        }
      ],
      "sprite": "marisa_sprite.png",
      "audio": {
        "attack_sound": "marisa_attack.wav",
        "ability_sound": "master_spark.wav"
      }
    },
    {
      "id": "character3",
      "name": "Sakuya Izayoi",
      "description": "Perfect and Elegant Servant",
      "movement_speed": "Medium",
      "focused_speed": "Fast",
      "initial_bombs": 4,
      "bomb_cherry_loss": "Medium",
      "special_ability": [ "Large grazing coverage.", "Low loss of cherry points after getting hit." ],
      "shot_types": [
        {
          "name": "Shot Type A: Illusion Sign -Attack-Range-Oriented Type-",
          "unfocused_shot": "Jack the Ludo Bile: Sakuya throws a wide spread of knives, covering a good portion of the screen when at full power, but they're weak.",
          "focused_shot": "Jack the Ripper: All of Sakuya's knives will home in on the nearest enemy. This is less useful than Reimu's homing shots- you can't hit enemies behind Sakuya.",
          "unfocused_bomb": "Indiscriminate: Sakuya throws knives in all directions, completely randomly, but only for a very short time, taking out enemies and bullets.",
          "focused_bomb": "Killer Doll: Sakuya gets a load of knives ready, and aims them at enemies on-screen, causing damage and taking out any bullets they hit."
        },
        {
          "name": "Shot Type B: Time Sign -Tricky Type-",
          "unfocused_shot": "Misdirection: Sakuya throws knives ahead of her, but when you move left or right, her knives and her floating 'options' will tilt and fire in that direction. When you stop moving, they settle back in place.",
          "focused_shot": "Power Direction: Same as above but you can lock Sakuya's 'options' in place, always firing to the left or right. Sakuya's normal knives will fire straight forward.",
          "unfocused_bomb": "Perfect Square: Sakuya stops time, and she freezes all on-screen bullets. You can graze them while they're like this, as Sakuya's speed increases greatly. When the bomb wears off, all frozen bullets become Star Items.",
          "focused_bomb": "Private Square: Same as above, but a purple box appears- you can direct this into enemies to inflict damage."
        }
      ],
      "weapons": [
        {
          "id": "weapon1",
          "name": "Marisa's Master Spark",
          "type": "laser",
          "damage": 30,
          "fire_rate": 1.0,
          "speed": 6,
          "range": 800
        }
      ],
      "abilities": [
        {
          "id": "ability1",
          "name": "Magic Missile",
          "cooldown": 8,
          "effect": "Single-target burst damage",
          "duration": 0,
          "area_of_effect": 0
        }
      ],
      "sprite": "marisa_sprite.png",
      "audio": {
        "attack_sound": "marisa_attack.wav",
        "ability_sound": "master_spark.wav"
      }
    }
  ]
}
